{
  "Apple___Apple_scab": [
    " Use scab-resistant apple varieties like ‘Liberty’ or ‘Enterprise’.",
    "Apply fungicides early in the season—before or during bud break.",
    "Rake and dispose of fallen leaves and infected fruits.",
    "Prune to open the canopy for better airflow and sunlight penetration.",
"Avoid overhead irrigation, especially during moist, warm periods.",
"Use mulch to prevent splash dispersal of fungal spores.",
"Rotate fungicides to prevent resistance buildup.",
"Monitor for early leaf spots and act quickly.",
"Remove mummified fruits from branches during dormant season.",
"Sanitize equipment used for pruning or spraying."
  ],
  "Apple___Black_rot": [
"Prune out infected branches and remove cankers during dormancy.",
"Remove mummified fruits and any fruit with black spots.",
"Apply fungicides like captan or thiophanate-methyl during bloom and fruit development.",
"Maintain good air circulation by proper pruning and tree spacing.",
"Do not leave dead branches or fruit in the orchard.",
"Sanitize tools to avoid spreading the fungus.",
"Avoid planting apple trees near infected red cedar trees.",
"Remove all plant debris from around the tree base.",
"Mulch around trees to suppress spore splash.",
"Monitor for small circular purple spots on leaves and fruits."  
],
  "Apple___Cedar_apple_rust": [
"    Remove nearby cedar or juniper trees, which host the alternate stage of the fungus.",
"Apply fungicides (e.g., myclobutanil) starting in early spring.",
"Plant rust-resistant apple cultivars such as ‘Redfree’ or ‘Enterprise’.",
"Prune trees annually to allow better air movement and drying.",
"Inspect for yellow-orange leaf spots and remove infected leaves early.",
"Discard galls from cedar trees before they produce spores.",
"Avoid planting apples near susceptible junipers.",
"Use protective sprays during rainy spring conditions.",
"Sanitize pruning tools regularly.",
"Maintain balanced fertilization for stronger plant immunity."
  ],
  "Apple___healthy": [
"No precautions needed.",
"✅ Keep monitoring for symptoms.",
"✅ Maintain general plant hygiene, proper nutrition, and routine pruning." 
 ],
  "Blueberry___healthy": [
     "The plant shows no signs of disease. Still, follow these general care practices to keep the plant healthy:",
    "Ensure well-drained, acidic soil (pH 4.5–5.5).",
    "Water consistently, especially during dry periods.",
    "Apply mulch to conserve moisture and suppress weeds.",
    "Prune annually to improve air circulation and fruit production.",
    "Avoid over-fertilization, which may damage roots.",
    "Keep an eye out for early signs of leaf spots or stem blight.",
    "Net plants to protect from birds.",
    "Test soil annually and amend as needed.",
    "Use disease-free, certified plants for propagation.",
    "Maintain clean garden tools to prevent infections."
  ],
  "Cherry_(including_sour)___Powdery_mildew": [
    "Plant powdery mildew-resistant cherry varieties when available.",
    "Apply sulfur-based or systemic fungicides at bud break and during early fruit development.",
    "Prune cherry trees regularly to promote good air circulation.",
    "Remove and destroy infected leaves or twigs immediately.",
    "Avoid overhead irrigation—wet leaves encourage fungal growth.",
    "Ensure trees receive adequate sunlight.",
    "Fertilize appropriately, avoiding excess nitrogen which promotes soft tissue.",
    "Clean up fallen leaves and debris before winter to prevent overwintering spores.",
    "Space trees far enough to reduce humidity between them.",
    "Disinfect tools after pruning infected trees."
  ],
  "Cherry_(including_sour)___healthy": [
     "✅ The plant shows no visible signs of disease or damage. To keep cherry trees healthy, follow these general precautions:",
    "Plant in well-drained soil with good air circulation and full sunlight.",
    "Use disease-resistant cultivars when possible.",
    "Prune annually to remove weak or crossing branches and to promote airflow.",
    "Apply balanced fertilizers as per soil test recommendations.",
    "Water regularly, especially during dry periods, but avoid overwatering.",
    "Keep the area around the tree free from fallen leaves and fruit.",
    "Mulch around the base to retain moisture and suppress weeds.",
    "Protect trees from pests and birds with nets or barriers.",
    "Monitor for early signs of fungal infections like powdery mildew.",
    "Keep tools clean and sanitized to prevent the spread of pathogens."
  ],
  "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": [
     "Plant resistant corn hybrids suited for your region.",
    "Rotate crops with non-hosts like soybeans for at least 2 years.",
    "Avoid continuous corn cultivation in the same field.",
    "Remove and plow under crop residues after harvest to reduce spore sources.",
    "Apply fungicides such as strobilurins or triazoles at tasseling if disease risk is high.",
    "Maintain proper plant spacing to allow air circulation.",
    "Scout fields regularly, especially during humid, warm conditions.",
    "Avoid excessive nitrogen fertilization, which promotes lush foliage.",
    "Irrigate in early morning to allow foliage to dry quickly.",
    "Monitor for small rectangular gray lesions on lower leaves and treat early."
  ],
  "Corn_(maize)___Common_rust_": [
   "Plant rust-resistant corn hybrids suitable for your local region.",
    "Rotate crops to reduce pathogen buildup in the soil.",
    "Scout fields regularly, especially during warm, humid weather.",
    "Remove and plow under infected plant debris after harvest.",
    "Apply fungicides (e.g., azoxystrobin, propiconazole) if rust appears before tasseling.",
    "Maintain proper plant spacing for good airflow.",
    "Irrigate early in the day to allow leaves to dry quickly.",
    "Monitor for reddish-brown pustules on both leaf surfaces.",
    "Avoid over-fertilization, especially with nitrogen.",
    "Use certified disease-free seeds to prevent introducing the fungus."
  ],
  "Corn_(maize)___Northern_Leaf_Blight": [
      "Plant resistant or tolerant corn hybrids adapted to your region.",
    "Rotate crops with non-hosts (e.g., soybeans) for at least one season.",
    "Plow under crop residues after harvest to reduce overwintering spores.",
    "Scout fields frequently—watch for cigar-shaped gray-green lesions on leaves.",
    "Apply fungicides (e.g., triazoles, strobilurins) during early tassel if disease risk is high.",
    "Maintain proper row spacing to allow good air circulation.",
    "Avoid excessive irrigation or wet foliage, especially in late afternoon.",
    "Keep the field free of volunteer corn plants and weeds.",
    "Fertilize based on soil test results to avoid overgrowth and susceptibility.",
    "Sanitize equipment used in infected fields to prevent pathogen spread."
  ],
  "Corn_(maize)___healthy": [
     "✅ The plant is healthy and free from visible diseases. To maintain its health and prevent future infections:",
    "Use certified disease-free seeds to start your crop.",
    "Practice crop rotation with non-host crops like legumes.",
    "Ensure well-drained soil and avoid waterlogging.",
    "Space plants properly to improve air circulation.",
    "Apply balanced fertilizers based on soil tests.",
    "Irrigate at the base of plants—avoid wetting the foliage.",
    "Monitor regularly for pests and early signs of disease.",
    "Remove plant debris and practice field sanitation after harvest.",
    "Use resistant corn varieties when available.",
    "Maintain weed control to reduce competition and pest habitats."
  ],
  "Grape___Black_rot": [
     "Remove and destroy infected leaves, mummified grapes, and tendrils.",
    "Apply fungicides (e.g., mancozeb, captan) early in the season.",
    "Train grapevines on a trellis to enhance air circulation.",
    "Use drip irrigation instead of overhead watering.",
    "Clean fallen debris and weed regularly.",
    "Avoid planting in areas with poor drainage.",
    "Space vines properly to reduce leaf wetness duration.",
    "Monitor leaves for brown lesions with black centers.",
    "Remove infected parts immediately.",
    "Rotate chemical classes to avoid resistance."
  ],
  "Grape___Esca_(Black_Measles)": [
    "Prune infected vines during the dormant season and remove canes showing symptoms.",
    "Disinfect pruning tools between cuts to avoid spreading the fungus.",
    "Avoid pruning in wet or humid conditions, which favor fungal entry.",
    "Remove and burn all infected wood and debris from the vineyard.",
    "Avoid wounding the vines, especially during hot periods.",
    "Improve drainage and avoid over-irrigation to reduce vine stress.",
    "Avoid excessive use of nitrogen fertilizers that promote vigorous but weak growth.",
    "Use certified, disease-free planting material.",
    "Consider applying fungicidal trunk paint after pruning large wounds.",
    "Monitor for symptoms such as tiger-striped leaves, dried berries, and wood decay."
  ],
  "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": [
    "Remove and destroy infected leaves and pruning debris during and after the growing season.",
    "Prune grapevines to improve air circulation and sunlight penetration.",
    "Apply fungicides (e.g., mancozeb, copper-based products) during early leaf development.",
    "Avoid overhead irrigation, which increases leaf wetness and disease spread.",
    "Train vines properly on trellises to reduce humidity around foliage.",
    "Use disease-free planting material and clean tools before pruning.",
    "Rotate fungicides with different modes of action to prevent resistance.",
    "Scout regularly for early signs—dark angular spots with yellow halos on leaves.",
    "Keep the vineyard floor weed-free to reduce humidity and host plants.",
    "Avoid excess nitrogen fertilization, which encourages dense, disease-prone foliage."
  ],
  "Grape___healthy": [
   "Use disease-resistant grape varieties suited to your region.",
    "Ensure proper vineyard spacing and training to allow airflow and sunlight.",
    "Water at the base and avoid wetting foliage to reduce disease risk.",
    "Apply balanced fertilizers based on soil test recommendations.",
    "Prune regularly to remove dead or crowded growth.",
    "Keep the vineyard floor clean and free of fallen leaves and debris.",
    "Mulch around plants to retain moisture and suppress weeds.",
    "Monitor for early signs of pests or diseases during the growing season.",
    "Avoid excess nitrogen, which promotes overly dense foliage.",
    "Sanitize pruning tools to prevent accidental disease spread."
  ],
  "Orange___Haunglongbing_(Citrus_greening)": [
    "Regularly inspect citrus trees for yellow shoots, blotchy leaves, and misshapen fruits.",
    "Control the Asian citrus psyllid, the insect that spreads the disease, using insecticides or natural predators.",
    "Remove and destroy infected trees immediately to prevent the spread to healthy ones.",
    "Use certified disease-free nursery stock for planting.",
    "Apply horticultural oils or systemic insecticides to reduce psyllid populations.",
    "Promote tree health through balanced fertilization and irrigation.",
    "Install yellow sticky traps to monitor psyllid presence in the orchard.",
    "Educate farm workers about identifying symptoms and vectors of the disease.",
    "Collaborate with local agriculture departments for area-wide management programs.",
    "Avoid moving citrus plant material between regions to prevent disease introduction."
  ],
  "Peach___Bacterial_spot": [
   "Plant resistant or tolerant peach varieties whenever possible.",
    "Prune trees annually to increase air circulation and reduce humidity around foliage.",
    "Avoid overhead irrigation to prevent water splashing that spreads bacteria.",
    "Apply copper-based bactericides during the dormant and growing seasons.",
    "Remove and destroy infected leaves, twigs, and fruits promptly.",
    "Control insects that create wounds through which bacteria enter.",
    "Ensure proper spacing between trees to allow for ventilation and sunlight.",
    "Avoid working in the orchard when leaves are wet to reduce contamination risk.",
    "Use certified disease-free planting material.",
    "Maintain overall tree health with balanced fertilization and proper watering."
  ],
  "Peach___healthy": [
    "Plant certified disease-free and locally adapted peach varieties.",
    "Ensure proper tree spacing and prune annually to improve air circulation.",
    "Water at the base of the tree to avoid wetting leaves and reduce fungal risk.",
    "Apply balanced fertilizers based on soil test results to maintain tree vigor.",
    "Regularly monitor for early signs of pests or disease symptoms.",
    "Keep the area around trees clean and free of fallen leaves or fruit.",
    "Use mulch to retain soil moisture and suppress weeds.",
    "Avoid pruning during wet conditions to reduce the risk of bacterial infection.",
    "Sanitize tools before and after use to prevent disease spread.",
    "Control insects that may serve as vectors for diseases like bacterial spot."
  ],
  "Pepper,_bell___Bacterial_spot": [
    "Use certified disease-free seeds and resistant pepper varieties if available.",
    "Avoid overhead watering to reduce leaf wetness and bacterial spread.",
    "Apply copper-based bactericides during early growth stages to limit infection.",
    "Practice crop rotation with non-host crops for at least 2–3 years.",
    "Remove and destroy infected plants and plant debris immediately.",
    "Avoid working in the field when plants are wet to prevent bacterial transfer.",
    "Disinfect tools and equipment regularly to prevent contamination.",
    "Provide proper spacing between plants to improve air circulation.",
    "Avoid excessive nitrogen, which encourages lush, disease-prone foliage.",
    "Control insects that cause wounds and allow bacterial entry."
  ],
  "Pepper,_bell___healthy": [
     "Use high-quality, certified disease-free seeds or seedlings.",
    "Plant in well-drained soil with good sunlight exposure.",
    "Water at the base of the plant and avoid overhead irrigation.",
    "Practice crop rotation with non-solanaceous crops to reduce disease buildup.",
    "Maintain proper spacing to promote air circulation and reduce humidity.",
    "Fertilize appropriately based on soil test recommendations to ensure balanced nutrition.",
    "Regularly inspect for pests and early disease symptoms.",
    "Remove weeds and debris around plants to prevent pest harborage.",
    "Mulch to conserve moisture and prevent soil-borne disease splash.",
    "Sanitize garden tools regularly to avoid unintentional disease transmission."
  ],
  "Potato___Early_blight": [
    "Use certified, disease-free seed potatoes for planting.",
    "Rotate crops with non-host plants for at least 2–3 years.",
    "Apply fungicides (e.g., chlorothalonil, mancozeb) at early signs of infection.",
    "Avoid overhead irrigation to minimize leaf wetness.",
    "Ensure proper plant spacing to allow good air circulation.",
    "Remove and destroy infected plant debris after harvest.",
    "Fertilize adequately to maintain plant health and resistance.",
    "Mulch around plants to prevent soil from splashing onto foliage.",
    "Monitor regularly for small dark brown leaf spots with concentric rings.",
    "Avoid working with wet plants to prevent spreading the fungus."
  ],
  "Potato___Late_blight": [
    "Use certified, disease-free seed potatoes to avoid introducing the pathogen.",
    "Plant in well-drained soil and avoid low-lying, damp areas.",
    "Apply protectant fungicides (e.g., chlorothalonil or mancozeb) before symptoms appear, especially in wet weather.",
    "Remove and destroy infected plants and tubers immediately.",
    "Avoid overhead irrigation and water early in the day to allow leaves to dry quickly.",
    "Ensure adequate spacing between plants to promote airflow.",
    "Practice crop rotation with non-host crops for at least 3 years.",
    "Do not leave cull piles or infected tubers in the field.",
    "Monitor closely for water-soaked lesions with white mold on the undersides of leaves.",
    "Clean and disinfect tools and equipment regularly to prevent disease spread."
  ],
  "Potato___healthy": [
    "Use certified, disease-free seed potatoes suitable for your region.",
    "Plant in well-drained soil with good sunlight and airflow.",
    "Rotate crops annually to avoid buildup of soil-borne pathogens.",
    "Water at the base of the plant and avoid wetting the foliage.",
    "Apply fertilizers based on soil testing to ensure balanced nutrition.",
    "Mulch around plants to retain moisture and reduce weed pressure.",
    "Monitor regularly for pests and early signs of disease.",
    "Remove any volunteer potatoes or weeds from previous crops.",
    "Harvest at the proper time and cure tubers in a dry, cool place.",
    "Store potatoes in a well-ventilated, dark, and dry area to prevent rot."
  ],
  "Raspberry___healthy": [
    "Plant disease-free, certified raspberry varieties suited to your region.",
    "Ensure proper spacing and prune regularly to improve air circulation.",
    "Water at the base to keep foliage dry and reduce fungal risks.",
    "Apply balanced fertilizers according to soil test recommendations.",
    "Mulch to conserve moisture, suppress weeds, and prevent soil splash.",
    "Monitor plants regularly for signs of pests or early disease symptoms.",
    "Remove and destroy any old or weak canes after fruiting.",
    "Avoid overcrowding to minimize humidity and leaf wetness.",
    "Keep the planting area free from weeds and fallen debris.",
    "Sanitize tools before and after pruning to prevent disease transmission."
  ],
  "Soybean___healthy": [
    "Use certified, disease-free soybean seeds for planting.",
    "Select varieties with built-in resistance to common regional diseases.",
    "Practice crop rotation with non-legume crops to break disease cycles.",
    "Ensure well-drained soil and avoid planting in waterlogged areas.",
    "Inoculate seeds with beneficial rhizobia bacteria to improve nitrogen fixation.",
    "Monitor regularly for early signs of pests and diseases.",
    "Apply fertilizers based on soil test recommendations for balanced nutrition.",
    "Maintain proper plant spacing to improve airflow and reduce humidity.",
    "Remove and destroy crop debris after harvest to prevent overwintering pathogens.",
    "Clean farm equipment regularly to avoid disease spread between fields."
  ],
  "Squash___Powdery_mildew": [
     "Plant resistant squash varieties when available to reduce disease risk.",
    "Ensure good air circulation by proper spacing and regular pruning of dense foliage.",
    "Avoid overhead irrigation—water at the base of plants to keep leaves dry.",
    "Apply preventive fungicides (e.g., sulfur, potassium bicarbonate) when conditions favor disease.",
    "Remove and destroy infected leaves as soon as symptoms appear.",
    "Avoid excessive nitrogen fertilization, which encourages lush, susceptible growth.",
    "Rotate crops and avoid planting squash in the same spot each year.",
    "Keep the garden free of plant debris and weeds to limit humidity.",
    "Monitor plants regularly, especially in warm and dry conditions where mildew thrives.",
    "Disinfect garden tools after working with infected plants to prevent spread."
  ],
  "Strawberry___Leaf_scorch": [
    "Use certified, disease-free strawberry plants from reliable nurseries.",
    "Choose resistant cultivars if available for your region.",
    "Ensure proper plant spacing to allow good airflow and reduce humidity.",
    "Avoid overhead irrigation—use drip irrigation to keep leaves dry.",
    "Remove and destroy infected or dead leaves to limit disease spread.",
    "Apply recommended fungicides (e.g., myclobutanil or captan) during early growth stages if needed.",
    "Practice crop rotation and avoid planting strawberries in the same spot every year.",
    "Mulch around the base of the plants to reduce splash from soil-borne pathogens.",
    "Avoid working in wet fields to prevent spreading the fungus via tools or hands.",
    "Clean and disinfect garden tools and equipment regularly."
  ],
  "Strawberry___healthy": [
     "Plant disease-free, certified strawberry varieties suited to your region.",
    "Choose a sunny, well-drained location for planting.",
    "Use mulch (like straw or black plastic) to suppress weeds and reduce soil splash.",
    "Water at the base of plants to avoid wetting the leaves and fruit.",
    "Maintain proper spacing to promote airflow and reduce humidity.",
    "Fertilize appropriately based on soil test results for healthy growth.",
    "Remove any old or damaged leaves and spent flowers regularly.",
    "Monitor for early signs of pests or diseases and act promptly.",
    "Rotate strawberry beds every 2–3 years to reduce disease buildup.",
    "Clean tools and avoid working in the patch when plants are wet."
  ],
  "Tomato___Bacterial_spot": [
     "Use certified, disease-free seeds and resistant tomato varieties when available.",
    "Avoid overhead irrigation—water at the base to keep leaves dry.",
    "Apply copper-based bactericides early in the season to manage spread.",
    "Rotate crops and avoid planting tomatoes or other solanaceous crops in the same spot each year.",
    "Remove and destroy infected plants and plant debris promptly.",
    "Avoid working with wet plants to reduce the chance of spreading bacteria.",
    "Ensure proper plant spacing for adequate air circulation and reduced humidity.",
    "Control insects that can cause wounds and serve as entry points for bacteria.",
    "Disinfect tools and equipment before and after use in the garden.",
    "Maintain overall plant health through balanced fertilization and regular monitoring."
  ],
  "Tomato___Early_blight": [
    "Use certified, disease-free seeds or transplants for planting.",
    "Rotate crops and avoid planting tomatoes or potatoes in the same soil for at least 2–3 years.",
    "Apply fungicides (e.g., chlorothalonil or mancozeb) at early signs of disease.",
    "Water at the base of plants to avoid wetting leaves, which encourages fungal growth.",
    "Remove and destroy infected leaves and plant debris from the garden.",
    "Space plants properly and prune lower leaves to improve air circulation.",
    "Mulch around the base of plants to prevent soil from splashing onto foliage.",
    "Avoid overhead irrigation and irrigate early in the day to allow leaves to dry.",
    "Support tomato plants with cages or stakes to keep foliage off the soil.",
    "Disinfect gardening tools after use to prevent disease spread."
  ],
  "Tomato___Late_blight": [
    "Use certified disease-free seeds or transplants to avoid introducing the pathogen.",
    "Plant resistant or tolerant tomato varieties if available.",
    "Apply fungicides (e.g., chlorothalonil, mancozeb) preventively, especially in wet, humid conditions.",
    "Water at the base of plants and avoid overhead irrigation to keep foliage dry.",
    "Remove and destroy infected leaves and plant debris promptly.",
    "Space plants properly to improve air circulation and reduce humidity.",
    "Mulch around plants to reduce soil splash and weed growth.",
    "Support plants with cages or stakes to keep leaves off the ground.",
    "Monitor regularly for early symptoms like dark water-soaked lesions.",
    "Clean and disinfect tools and equipment after working in the garden."
  ],
  "Tomato___Leaf_Mold": [
     "Use resistant tomato varieties when available to reduce disease risk.",
    "Ensure good air circulation by proper plant spacing and pruning.",
    "Avoid overhead irrigation; water plants at the base to keep leaves dry.",
    "Apply fungicides such as copper-based products or chlorothalonil early in the season.",
    "Remove and destroy infected leaves promptly to limit disease spread.",
    "Mulch around plants to reduce soil splash and retain moisture.",
    "Avoid excessive nitrogen fertilization which encourages dense foliage.",
    "Monitor plants regularly, especially during warm and humid conditions.",
    "Practice crop rotation with non-host crops for at least two years.",
    "Clean and disinfect tools after working with infected plants."
  ],
  "Tomato___Septoria_leaf_spot": [
      "Use certified disease-free seeds and resistant varieties if available.",
    "Practice crop rotation with non-solanaceous crops for at least 2-3 years.",
    "Apply fungicides such as chlorothalonil or copper-based sprays at early disease signs.",
    "Avoid overhead irrigation to reduce leaf wetness and disease spread.",
    "Space plants properly to ensure good air circulation.",
    "Remove and destroy infected leaves and plant debris promptly.",
    "Mulch around plants to prevent soil splash onto foliage.",
    "Water early in the day so foliage dries quickly.",
    "Disinfect gardening tools regularly to prevent pathogen spread.",
    "Monitor plants frequently during warm and wet weather."
  ],
  "Tomato___Spider_mites Two-spotted_spider_mite": [
    "Regularly inspect tomato plants, especially the undersides of leaves, for mite presence.",
    "Maintain adequate irrigation and avoid drought stress, as spider mites thrive in dry conditions.",
    "Use insecticidal soaps or miticides specifically labeled for spider mite control.",
    "Introduce or conserve natural predators like predatory mites (Phytoseiulus persimilis).",
    "Avoid excessive use of broad-spectrum insecticides that can kill beneficial insects.",
    "Remove heavily infested leaves or plants to reduce mite populations.",
    "Keep surrounding weeds under control, as they can harbor spider mites.",
    "Provide shade or humidity during hot, dry periods to reduce mite proliferation.",
    "Use reflective mulches to deter spider mites.",
    "Rotate chemical controls with different modes of action to prevent resistance."

  ],
  "Tomato___Target_Spot": [
     "Use disease-free seeds and resistant tomato varieties when available.",
    "Practice crop rotation with non-host crops for at least 2-3 years.",
    "Apply fungicides such as chlorothalonil or copper-based sprays at early signs of infection.",
    "Avoid overhead irrigation to reduce leaf wetness and disease spread.",
    "Maintain proper plant spacing to enhance air circulation.",
    "Remove and destroy infected leaves and plant debris promptly.",
    "Mulch around plants to prevent soil splash onto foliage.",
    "Water early in the day to allow foliage to dry quickly.",
    "Disinfect gardening tools regularly to prevent pathogen spread.",
    "Monitor plants frequently, especially during warm and humid weather."
  ],
  "Tomato___Tomato_Yellow_Leaf_Curl_Virus": [
     "Use virus-free seeds or transplants from certified sources.",
    "Control whitefly populations, the primary vector, using insecticides or natural predators.",
    "Remove and destroy infected plants immediately to prevent spread.",
    "Use reflective mulches to repel whiteflies.",
    "Implement crop rotation with non-host crops to reduce virus buildup.",
    "Avoid planting tomatoes near crops highly attractive to whiteflies.",
    "Maintain good weed control around tomato fields to reduce alternate hosts.",
    "Use insect-proof screens or netting in greenhouses.",
    "Apply balanced fertilization to keep plants healthy and less susceptible.",
    "Regularly scout fields for early detection of symptoms and whitefly presence."
  ],
  "Tomato___Tomato_mosaic_virus": [
    "Use virus-free seeds and transplants from certified sources.",
    "Remove and destroy infected plants immediately to prevent virus spread.",
    "Disinfect tools and equipment regularly, especially after working with infected plants.",
    "Control insect vectors such as aphids that can transmit the virus.",
    "Practice crop rotation with non-host crops to reduce virus buildup.",
    "Avoid working with tomato plants when they are wet to prevent mechanical transmission.",
    "Use resistant tomato varieties if available.",
    "Maintain good field sanitation by removing plant debris after harvest.",
    "Educate workers on recognizing symptoms and practicing hygiene.",
    "Avoid planting tomatoes near other solanaceous crops that may harbor the virus."
  ],
  "Tomato___healthy": [
    "Use certified disease-free seeds or seedlings suitable for your region.",
    "Plant tomatoes in well-drained soil with full sunlight exposure.",
    "Ensure proper spacing to allow good air circulation and reduce humidity.",
    "Water at the base of plants to keep foliage dry and reduce disease risk.",
    "Apply balanced fertilizers based on soil test recommendations.",
    "Mulch around plants to conserve moisture and prevent soil splash.",
    "Prune lower leaves and remove any damaged foliage regularly.",
    "Monitor plants regularly for early signs of pests or diseases.",
    "Practice crop rotation with non-solanaceous crops to reduce disease buildup.",
    "Clean and disinfect tools to prevent disease spread."
  ]
}